docs/comp-sci/nan-boxing.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>NaN Boxing</title>
<meta name="author" content="Alex Nelson" />
<meta name="generator" content="Org Mode" />
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\DeclareMathOperator{\tr}{tr}
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
% For +---- metric
\newcommand{\BDpos}{}
\newcommand{\BDneg}{-}
\newcommand{\BDposs}{\phantom{-}}
\newcommand{\BDnegg}{-}
\newcommand{\BDplus}{+}
\newcommand{\BDminus}{-}
% For -+++ metric
\newcommand{\BDpos}{-}
\newcommand{\BDposs}{-}
\newcommand{\BDneg}{}
\newcommand{\BDnegg}{\phantom{-}}
\newcommand{\BDplus}{-}
\newcommand{\BDminus}{+}
\)</div>
<link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">NaN Boxing</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-55385882-0ba1-4181-8cb2-ef3d7c2cfaec">1. Introduction</a>
<ul>
<li><a href="#h-8e806502-9bba-4a35-9640-b4a3406a1e41">1.1. Summary of NaN-Boxing</a></li>
</ul>
</li>
<li><a href="#h-d3cd56d2-092d-40c5-b462-224f2f02143d">2. Problems with NaN-Boxing</a>
<ul>
<li><a href="#h-316355cb-7ab7-436a-9c24-52e3e4877f58">2.1. Equality Fails</a></li>
</ul>
</li>
<li><a href="#h-1d641dab-d665-441e-9aee-68d8e1fac6f9">3. Alternatives</a>
<ul>
<li><a href="#h-6b6285ee-a96e-42e1-b1ec-dd1a95184df7">3.1. Pointer Tagging</a></li>
<li><a href="#h-eda564c0-559a-43dc-9a56-deacbe9a40b4">3.2. Pointer Tagging + Memory Management</a></li>
<li><a href="#h-d246718d-172f-4309-b2a0-0474ac03ff74">3.3. Pointer Alignment</a></li>
</ul>
</li>
<li><a href="#h-7d6a332d-1eef-4a35-9ba1-28f0e9211547">4. References</a>
<ul>
<li><a href="#h-7205480f-c3ae-40a8-b026-f60cbf467bc7">4.1. Example Implementations</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-h-55385882-0ba1-4181-8cb2-ef3d7c2cfaec" class="outline-2">
<h2 id="h-55385882-0ba1-4181-8cb2-ef3d7c2cfaec"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-h-55385882-0ba1-4181-8cb2-ef3d7c2cfaec">
<p>
The basic idea is that, if we are writing an interpreter or virtual
machine, then how can we distinguish a pointer from&#x2026;anything else?
</p>

<p>
One idea is to just use a naive data structure encoding the possible
values. At best, we would have an overhead of an additional 64-bits (on
a 64-bit system), doubling the size of a pointer.
</p>

<p>
But if we use a NaN, we can encode any 51-bit pointer (or 42-bit pointer
and we get \(2^{9}=512\) possible constants).
</p>

<p>
There is another alternative, to use tagged pointers.
</p>
</div>
<div id="outline-container-h-8e806502-9bba-4a35-9640-b4a3406a1e41" class="outline-3">
<h3 id="h-8e806502-9bba-4a35-9640-b4a3406a1e41"><span class="section-number-3">1.1.</span> Summary of NaN-Boxing</h3>
<div class="outline-text-3" id="text-h-8e806502-9bba-4a35-9640-b4a3406a1e41">
<p>
More explicitly, there are 2 types of NaN values (the sign bit is
arbitrary for NaN in both cases):
</p>

<ol class="org-ol">
<li>Quiet NaN: the exponent bits are all 1, the bit after the exponent is
"set" (i.e., equal to 1), and then the rest of the 51 bits in the Mantissa are arbitrary</li>
<li>Signaling NaN: the exponents are all 1, the bit after the exponent is
"unset" (i.e., equal to 0), and then the rest of the 51 bits are 0.</li>
</ol>

<p>
There are 51 free bits in the quiet NaN, so we use it to store information.
</p>
</div>
</div>
</div>
<div id="outline-container-h-d3cd56d2-092d-40c5-b462-224f2f02143d" class="outline-2">
<h2 id="h-d3cd56d2-092d-40c5-b462-224f2f02143d"><span class="section-number-2">2.</span> Problems with NaN-Boxing</h2>
<div class="outline-text-2" id="text-h-d3cd56d2-092d-40c5-b462-224f2f02143d">
</div>
<div id="outline-container-h-316355cb-7ab7-436a-9c24-52e3e4877f58" class="outline-3">
<h3 id="h-316355cb-7ab7-436a-9c24-52e3e4877f58"><span class="section-number-3">2.1.</span> Equality Fails</h3>
<div class="outline-text-3" id="text-h-316355cb-7ab7-436a-9c24-52e3e4877f58">
<p>
We cannot meaningfully compare 2 NaN values, so equality fails. We'd
have to change it to a 64-bit integer for equality to work as
expected. This is a problem in Java, for example.
</p>

<ul class="org-ul">
<li><a href="http://ppkwok.blogspot.com/2012/11/java-cafe-1-never-write-nan-nan_24.html">Java Cafe 1: Never write <code>NaN == NaN</code> (they're not equal)</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-h-1d641dab-d665-441e-9aee-68d8e1fac6f9" class="outline-2">
<h2 id="h-1d641dab-d665-441e-9aee-68d8e1fac6f9"><span class="section-number-2">3.</span> Alternatives</h2>
<div class="outline-text-2" id="text-h-1d641dab-d665-441e-9aee-68d8e1fac6f9">
</div>
<div id="outline-container-h-6b6285ee-a96e-42e1-b1ec-dd1a95184df7" class="outline-3">
<h3 id="h-6b6285ee-a96e-42e1-b1ec-dd1a95184df7"><span class="section-number-3">3.1.</span> Pointer Tagging</h3>
<div class="outline-text-3" id="text-h-6b6285ee-a96e-42e1-b1ec-dd1a95184df7">
<p>
When we have a 64-bit system, it turns out that not all 64-bits are
necessary for pointers. After all, \(2^{30}\) bytes is a Gibibyte, and
\(20^{40}\) bytes is a Tebibyte, so a 40-bit pointer can access 1 Tebibyte
of memory; and \(2^{50}\) bytes is a Pebibyte. If we use 8 bits to store
metadata and 56 bits for information (the "payload"), then we can refer
to 64 Pebibytes (72.057 Petabytes) of memory.
</p>

<p>
For reference:
</p>
<ul class="org-ul">
<li>in May 2017, HP announced it built a computer with 160 Terabytes of RAM (<a href="https://www.bbc.com/news/technology-39936975">BBC</a>).</li>
<li>The architectural specifications for Intel64 and AMD64 specify 52-bit
pointer size for virtual memory addresses.</li>
<li>ARMv8.2 has a larger VA space of up to 52-bits, before this ARM had
48-bit virtual address size. (The bits 63:48 are set to 0 for
user-space, and 1 for kernel space.)</li>
</ul>

<p>
I have the feeling we may end up staggering into a false sense of
security, unwittingly imitating Bill Gates's 1985 remark to InfoWorld,
"When we set the upper limit of PC-DOS at 640K, we thought nobody would
ever need that much memory."
</p>

<p>
We may or may not even need 8 bits for metadata (heck, 3 bits may suffice).
</p>
</div>
</div>
<div id="outline-container-h-eda564c0-559a-43dc-9a56-deacbe9a40b4" class="outline-3">
<h3 id="h-eda564c0-559a-43dc-9a56-deacbe9a40b4"><span class="section-number-3">3.2.</span> Pointer Tagging + Memory Management</h3>
<div class="outline-text-3" id="text-h-eda564c0-559a-43dc-9a56-deacbe9a40b4">
<p>
The basic idea is that we will implement our own garbage collector,
which basically allocates an "arena" of memory (a glorified array of
contiguous bytes), then use our own "pointer" type (which is just an
index to our array of contiguous bytes). This basically rolls our own
<a href="https://en.wikipedia.org/wiki/Virtual_address_space">Virtual address space</a>.
</p>
</div>
</div>
<div id="outline-container-h-d246718d-172f-4309-b2a0-0474ac03ff74" class="outline-3">
<h3 id="h-d246718d-172f-4309-b2a0-0474ac03ff74"><span class="section-number-3">3.3.</span> Pointer Alignment</h3>
<div class="outline-text-3" id="text-h-d246718d-172f-4309-b2a0-0474ac03ff74">
<p>
We can <a href="https://en.wikipedia.org/wiki/Data_structure_alignment">recall</a> that a memory address \(A\) is <dfn>n-byte aligned</dfn>
when \(A\) is a multiple of \(n\). This means \(A\) has a minimum of
\(\log_{2}(n)\) least-significant zeros when expressed in binary.
</p>

<p>
So a 64-bit address (= 8-byte address) is aligned if at least
\(\log_{2}(8)=3\) least-significant bits are zeros when expressed in binary.
</p>

<p>
If we stipulate pointers are always from a <code>malloc</code> (and we are using a
64-bit computer), then we have 3 bits which we can use for metadata.
</p>

<ul class="org-ul">
<li>Max Bernstein, <a href="https://bernsteinbear.com/blog/small-objects/">Small objects and pointer tagging</a> 11 Feb 2021</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-h-7d6a332d-1eef-4a35-9ba1-28f0e9211547" class="outline-2">
<h2 id="h-7d6a332d-1eef-4a35-9ba1-28f0e9211547"><span class="section-number-2">4.</span> References</h2>
<div class="outline-text-2" id="text-h-7d6a332d-1eef-4a35-9ba1-28f0e9211547">
<ul class="org-ul">
<li><a href="https://anniecherkaev.com/the-secret-life-of-nan">the secret life of NaN</a></li>
<li>Leonard Schütz <a href="https://leonardschuetz.ch/blog/nan-boxing/">Dynamic Typing and NaN Boxing</a> 8 September 2020</li>
<li><a href="https://piotrduperas.com/posts/nan-boxing">NaN boxing or how to make the world dynamic</a></li>
<li><a href="http://ppkwok.blogspot.com/2012/11/java-cafe-1-never-write-nan-nan_24.html">Java Cafe 1: Never write <code>NaN == NaN</code> (they're not equal)</a></li>
<li><a href="https://bernsteinbear.com/blog/compiling-a-lisp-2/">Compiling a Lisp: Integers</a></li>
<li><a href="https://bernsteinbear.com/blog/compiling-a-lisp-3/">Compiling a Lisp: Booleans, characters, nil</a></li>
<li>Bob Nystrom, <a href="https://craftinginterpreters.com/optimization.html">Crafting Interpreters</a> chapter 30 on optimization</li>
<li>Nikita Popov, <a href="https://www.npopov.com/2012/02/02/Pointer-magic-for-efficient-dynamic-value-representations.html">Pointer magic for efficient dynamic value representations</a> 
2 February 2012, discusses examples with C++ code</li>
<li>Albert Yang, <a href="https://albertnetymk.github.io/2016/08/06/nan_boxing/">NaN Boxing</a> 6 Aug 2016 for example C code</li>
<li><a href="http://wingolog.org/archives/2011/05/18/value-representation-in-javascript-implementations">value representation in javascript implementations</a> 18 May 2011</li>
<li>David Gudeman's "Representing Type Information in Dynamically Typed
Languages" October 1993 <a href="https://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.39.4394&amp;rep=rep1&amp;type=pdf">PDF</a></li>
<li><a href="https://webkit.org/blog/7846/concurrent-javascript-it-can-work/">https://webkit.org/blog/7846/concurrent-javascript-it-can-work/</a></li>
<li><a href="https://stackoverflow.com/questions/57348783/how-does-v8-store-integers-like-5">https://stackoverflow.com/questions/57348783/how-does-v8-store-integers-like-5</a></li>
<li><a href="https://stackoverflow.com/questions/16198700/using-the-extra-16-bits-in-64-bit-pointers">https://stackoverflow.com/questions/16198700/using-the-extra-16-bits-in-64-bit-pointers</a></li>
<li><a href="https://v8.dev/blog/pointer-compression">https://v8.dev/blog/pointer-compression</a></li>
</ul>
</div>
<div id="outline-container-h-7205480f-c3ae-40a8-b026-f60cbf467bc7" class="outline-3">
<h3 id="h-7205480f-c3ae-40a8-b026-f60cbf467bc7"><span class="section-number-3">4.1.</span> Example Implementations</h3>
<div class="outline-text-3" id="text-h-7205480f-c3ae-40a8-b026-f60cbf467bc7">
<ul class="org-ul">
<li>zuiderkwast's <a href="https://github.com/zuiderkwast/nanbox">nanboxing</a> single header library for C</li>
<li>Femtolisp's <a href="https://github.com/JeffBezanson/femtolisp/blob/master/flisp.h">object implementation</a></li>
<li><a href="https://source.chromium.org/chromium/v8/v8.git/+/46afc4f9a6008c3880fcc00783b4210cb467aa9a:src/objects/smi.h;l=23">https://source.chromium.org/chromium/v8/v8.git/+/46afc4f9a6008c3880fcc00783b4210cb467aa9a:src/objects/smi.h;l=23</a></li>
<li>Chicken Scheme's <a href="https://wiki.call-cc.org/man/4/Data%20representation">data representation</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated: Sat, 26 Aug 2023 07:40:08 -0700
</div>
</body>
</html>
